In [1]:
import numpy as np
import pandas as pd

# Concatenation

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [3]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [4]:
one = pd.DataFrame(data_one)

In [5]:
two = pd.DataFrame(data_two)

In [6]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [7]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
axis0 = pd.concat([one, two], axis = 0)
axis0

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [11]:
axis1 = pd.concat([one, two], axis = 1)
axis1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [12]:
two.columns = one.columns

In [13]:
pd.concat([one,two])

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [14]:
pd.concat([one,two], ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

## Merge

In [15]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

## pd.merge

## Inner

In [19]:
pd.merge(registrations,logins, how="inner", on= "name")

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [20]:
pd.merge(registrations,logins, how="inner")

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [21]:
pd.merge(registrations, logins, how="left", on="name")

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [22]:
pd.merge(registrations, logins, how="right", on="name")

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [23]:
pd.merge(registrations, logins, how="outer", on="name")

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [24]:
registrations = registrations.set_index("name")
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [30]:
logins = logins.set_index("name")
logins

         log_id
name
Xavier        1
Andrew        2
Yolanda       3
Bobo          4

In [32]:
pd.merge(registrations, logins, left_index=True, right_index=True, how="inner")

        reg_id  log_id
name
Andrew       1       2
Bobo         2       4

In [33]:
pd.merge(registrations, logins, left_index=True, right_index=True, how="outer", indicator=True)

         reg_id  log_id      _merge
name
Andrew      1.0     2.0        both
Bobo        2.0     4.0        both
Claire      3.0     NaN   left_only
David       4.0     NaN   left_only
Xavier      NaN     1.0  right_only
Yolanda     NaN     3.0  right_only

In [34]:
registrations = registrations.reset_index()

In [35]:
logins = logins.reset_index()

In [36]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [37]:
logins

      name  log_id
0   Xavier       1
1   Andrew       2
2  Yolanda       3
3     Bobo       4

In [38]:
registrations.columns = ["reg_name","reg_id"]

In [39]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [40]:
result = pd.merge(registrations, logins, how="inner", left_on="reg_name", right_on="name")

In [41]:
result

  reg_name  reg_id    name  log_id
0   Andrew       1  Andrew       2
1     Bobo       2    Bobo       4

In [42]:
result.drop("reg_name", axis=1)

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [43]:
registrations.columns = ["name","id"]

In [44]:
logins.columns = ["name","id"]

In [45]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [46]:
logins

      name  id
0   Xavier   1
1   Andrew   2
2  Yolanda   3
3     Bobo   4

In [47]:
pd.merge(registrations, logins, how="inner", on ="name")

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [49]:
pd.merge(registrations, logins, how="inner", on ="name", suffixes=("_reg", "_log"))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4